Pandas

Series are used to work with one dimensional array, whereas DataFrame can be used with two dimensional arrays. DataFrame has two different index i.e.column-index and row-index.

In [12]:
import pandas as pd

#converting tuple to series
tuple_data = ('aasai',23,'Engineer','Korea')
series = pd.Series(tuple_data,index=['name','age','profession','Loaction'])
print(series)
type(series)

name             aasai
age                 23
profession    Engineer
Loaction         Korea
dtype: object

pandas.core.series.Series

In [6]:
#converting dictionary to series

dict_data = {'name':'aasai','age':23,'Profession':'Engineer','Location':'Korea'}
series = pd.Series(dict_data)
print(series)
type(series)

name             aasai
age                 23
Profession    Engineer
Location         Korea
dtype: object

pandas.core.series.Series

In [29]:
#Elements of the Series can be accessed using index name e.g. f[‘shares’] or f[0]

dict_data['name']
tuple_data[0]

'aasai'

In [32]:
data = {'name':['aasai','praveen','nanda'],
       'age':[23,23,23],
       'Profession':['Engineer','Engineer','Engineer'],
       'native':['Coimbatore','Mayavaram','Thiruvallur']
       }
Data_frame = pd.DataFrame(data,index=['one','two','three'])
print(Data_frame)

          name  age Profession       native
one      aasai   23   Engineer   Coimbatore
two    praveen   23   Engineer    Mayavaram
three    nanda   23   Engineer  Thiruvallur

In [33]:
type(Data_frame)

pandas.core.frame.DataFrame

In [35]:
#Added Additional Column
Data_frame['country'] = ['India','India','India']
print(Data_frame)

          name  age Profession       native country
one      aasai   23   Engineer   Coimbatore   India
two    praveen   23   Engineer    Mayavaram   India
three    nanda   23   Engineer  Thiruvallur   India

In [46]:
#.loc for label based indexing or
#.iloc for positional indexing
Data_frame.loc['one']
Data_frame.iloc[0]

name               aasai
age                   23
Profession      Engineer
native        Coimbatore
country            India
Name: one, dtype: object

In [53]:
#All rows and first column access
Data_frame.iloc[:,0]
Data_frame.loc[:,'name']

one        aasai
two      praveen
three      nanda
Name: name, dtype: object

In [49]:
#All column and First row access
Data_frame.iloc[0,:]
Data_frame.loc['one',:]

name               aasai
age                   23
Profession      Engineer
native        Coimbatore
country            India
Name: one, dtype: object

In [57]:
#Access first row and third column syntax for accessing specific data
Data_frame.iloc[0,2]
#output : Engineer
Data_frame.loc['one','age']

23

In [58]:
#delete Profession column usingg del command
del Data_frame['Profession']
Data_frame

          name  age       native country
one      aasai   23   Coimbatore   India
two    praveen   23    Mayavaram   India
three    nanda   23  Thiruvallur   India

In [80]:
#Replace Aasai native to madurai using replace
Data_frame.replace(to_replace = 'Coimbatore',value = 'Madurai')
#Replace using location
Data_frame.loc['one','native'] = 'Madurai'
Data_frame

          name  age       native country
one      aasai   23      Madurai   India
two    praveen   23    Mayavaram   India
three    nanda   23  Thiruvallur   India